Revit 2027 API
CompoundStructure.CreateSingleLayerCompoundStructure Method
Overload List
Name | Description
CreateSingleLayerCompoundStructure(MaterialFunctionAssignment, Double, ElementId) |  Creates a CompoundStructure containing a single layer.
CreateSingleLayerCompoundStructure(Double, MaterialFunctionAssignment, Double, ElementId) |  Creates a vertically compound CompoundStructure with one layer.
Top
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace